{
  "en": {
    "waitingForOtherUser": "We are waiting for the other person to accept or decline, please stand by",
    "invitationCardTextareaLabel": "Your new friend",
    "invitationCardButtonYes": "Yes",
    "invitationCardButtonNo": "No",
    "invitationCardTitleWithName": "You have been matched with",
    "invitationCardExplanation": "Use the buttons below to decide if you want to talk to this person.",
    "waitingForInvitations": "We are waiting for someone for you to talk to. We will show you their name and introduction, and you can decide whether you want to talk to that person or not. You can press escape at any time to exit.",
    "cancelButton": "Cancel",
    "waitingRoomRegistrationError": "There was an error in the waiting room. Please refresh the page. Error Code: ",
    "disclaimerTitle": "First things first! Read the following disclaimer to continue to JitChat.",
    "disclaimerParagraph1": "Welcome to JitChat, a platform where you can chat with other users from around the world. You will be matched with a random user, and you will be able to talk to them in a 1:1 chatroom",
    "disclaimerParagraph2": "Even though it is possible to accept and reject chat invitations, please be aware of the following:",
    "disclaimerListItem1": "JitChat is not responsible for any of its users' behavior because there is no moderation in place. While we encourage our users to communicate in a respectful manner, we cannot guarantee that everyone will do so. Therefore, we cannot be held liable for any actions or interactions that occur on our platform.",
    "disclaimerListItem2": "We do not recommend that you use JitChat if you are under 16 years of age. However, if you choose to use our platform, it is your responsibility to filter out any unwanted/unsolicited behaviour from other users.",
    "disclaimerListItem3": "JitChat is not responsible for other users using a name that you previously used on the platform. We do not guarantee the uniqueness of usernames on this site.",
    "disclaimerListItem4": "JitChat does not collect any user data. we do not ask for an email address nor a real name nor do we collect your IP. We obtain your previously used name and intro by assigning a random string of characters as your ID and saving it to your computer's disk. Clearing out your local storage will reset your user ID.",
    "disclaimerParagraph3": "By using JitChat, you acknowledge and agree to these terms. We reserve the right to update this disclaimer at any time. If you have any questions or concerns, please contact Oriol Gómez.",
    "disclaimerContinueButton": "Continue to JitChat",
    "userFormName": "Name (minimum 5 characters, maximum 50):",
    "userFormIntro": "Tell us something about you, where are you from? What languages do you speak?  (minimum 50 characters, maximum 1000):",
    "userFormLanguages": "Select your preferred languages",
    "userFormEnter": "Submit",
    "userFormDataFound": "I have recovered your old user data from the server, in case you want to use it again.",
    "userFormNameError": "Please enter a valid name. It must contain from 5 to 50 characters and no emails or URLs.",
    "userFormIntroError": "Please enter a valid introduction. It must contain 50 to 1000 characters and no emails or web addresses are allowed"
  },
  "es": {
    "disclaimerTitle": "¡Lo primero es lo primero! Lee la siguiente información para continuar a JitChat",
    "disclaimerParagraph1": "Bienvenido a JitChat, una plataforma en la que podrás chatear con otros usuarios de todo el mundo. Se te conectará con un usuario aleatorio y podréis hablar en una sala de chat personal",
    "disclaimerParagraph2": "Aunque es posible aceptar y rechazar match con otros usuarios, por favor, ten en cuenta lo siguiente:",
    "disclaimerListItem1": "JitChat no se hace responsable del comportamiento de sus usuarios, ya que no existe ningún tipo de moderación. Aunque animamos a nuestros usuarios a comunicarse de forma respetuosa, no podemos garantizar que todos lo hagan. Por lo tanto, no nos hacemos responsables de las acciones o interacciones que se produzcan en nuestra plataforma.",
    "disclaimerListItem2": "Si tienes menos de 16 años, no te recomendamos que utilices JitChat. Sin embargo, si decides utilizar nuestra plataforma, lo haces bajo tu propia responsabilidad.",
    "disclaimerListItem3": "JitChat no se hace responsable de que otros usuarios utilicen un nombre que hayas usado previamente en la plataforma. No garantizamos la unicidad de los nombres de usuario en esta web.",
    "disclaimerListItem4": "JitChat no recopila ningún dato de los usuarios. No pedimos una dirección de correo electrónico ni un nombre real ni recopilamos tu IP. Obtenemos tu nombre e intro utilizados anteriormente asignando una cadena aleatoria de caracteres como tu ID y guardándola en el disco de tu ordenador. Si borras tu almacenamiento local, se restablecerá tu ID de usuario.",
    "disclaimerParagraph3": "Al utilizar JitChat, asumimos que estás de acuerdo con estos términos. Nos reservamos el derecho a actualizar este aviso legal en cualquier momento. Si tienes alguna pregunta o duda, ponte en contacto con Oriol Gómez.",
    "disclaimerContinueButton": "Continuar a JitChat",
    "userFormName": "Nombre (mínimo 5 caracteres, máximo 50):",
    "userFormIntro": "¡Cuéntanos lo que quieras sobre ti! ¿De dónde eres? ¿Qué idiomas hablas? (mínimo 50 caracteres y máximo 1000)",
    "userFormLanguages": "Selecciona los idiomas que hablas:",
    "userFormEnter": "Entrar",
    "userFormDataFound": "Hemos recuperado tu antiguo usuario del servidor, te lo dejo aquí por si lo quieres usar.",
    "userFormNameError": "Por favor introduce un nombre válido Debe contener de 5 a 50 caracteres, sin URLs ni direcciones de correo.",
    "userFormIntroError": "Por favor introduce una intro válida. Debe contener de 50 a 1000 caracteres, sin direcciones de correo ni URLs.",
    "waitingRoomRegistrationError": "Ha ocurrido un problema en la sala de espera. Por favor actualiza la página. Código de error: ",
    "cancelButton": "Cancelar",
    "waitingForInvitations": "Estamos esperando a que alguien esté disponible para hablar. te mostraremos su nombre e introducción y podrás decidir si quieres hablar con esa persona o no. puedes pulsar escape en cualquier momento para salir.",
    "invitationCardTitleWithName": "Te presentamos a",
    "invitationCardExplanation": "Pulsa los botones de abajo para decidir si quieres hablar con esta persona.",
    "invitationCardButtonYes": "Sí",
    "invitationCardButtonNo": "No",
    "invitationCardTextareaLabel": "Tu nueva amistad",
    "waitingForOtherUser": "Estamos esperando a la otra persona a que acepte o rechace, por favor espera..."
  }
}